Write a solution to report the first name, last name, city, and state of each person in the Person table. If the address of a personId is not present in the Address table, report null instead.

Return the result table in any order.

The result format is in the following example.

In [46]:
import pandas as pd

In [47]:
data = [[1, 'Wang', 'Allen'], [2, 'Alice', 'Bob']]
person = pd.DataFrame(data, columns=['personId', 'firstName', 'lastName']).astype({'personId':'Int64', 'firstName':'object', 'lastName':'object'})
person

   personId firstName lastName
0         1      Wang    Allen
1         2     Alice      Bob

In [48]:
data = [[1, 2, 'New York City', 'New York'], [2, 3, 'Leetcode', 'California']]
address = pd.DataFrame(data, columns=['addressId', 'personId', 'city', 'state']).astype({'addressId':'Int64', 'personId':'Int64', 'city':'object', 'state':'object'})
address

   addressId  personId           city       state
0          1         2  New York City    New York
1          2         3       Leetcode  California

In [49]:
n = person.merge(address, how="left")
n[["firstName", "lastName", "city", "state"]]

  firstName lastName           city     state
0      Wang    Allen            NaN       NaN
1     Alice      Bob  New York City  New York

Write a solution to find the employees who earn more than their managers.

Return the result table in any order.

The result format is in the following example.

In [50]:
data = [[1, 'Joe', 70000, 3], [2, 'Henry', 80000, 4], [3, 'Sam', 60000, None], [4, 'Max', 90000, None]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'managerId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'managerId':'Int64'})
employee

   id   name  salary  managerId
0   1    Joe   70000          3
1   2  Henry   80000          4
2   3    Sam   60000       <NA>
3   4    Max   90000       <NA>

In [51]:
emp = pd.merge(employee, employee, left_on="id", right_on="managerId", suffixes=["_manager", "_employee"])
r = emp.query("salary_employee > salary_manager")["name_employee"]
s = pd.DataFrame(r)
s = s.rename(columns={"name_employee": "Employee"})
s

  Employee
0      Joe

Write a solution to report all the duplicate emails. Note that it's guaranteed that the email field is not NULL.

Return the result table in any order.

The result format is in the following example.

In [52]:
data = [[1, 'a@b.com'], [2, 'c@d.com'], [3, 'a@b.com']]
person = pd.DataFrame(data, columns=['id', 'email']).astype({'id':'Int64', 'email':'object'})
person

   id    email
0   1  a@b.com
1   2  c@d.com
2   3  a@b.com

In [53]:

s = person.loc[person.duplicated("email") == True]
x = pd.DataFrame(s["email"].drop_duplicates())
x = x.rename(columns={"email" : "Email"})
x

     Email
2  a@b.com

Write a solution to delete all duplicate emails, keeping only one unique email with the smallest id.

For SQL users, please note that you are supposed to write a DELETE statement and not a SELECT one.

For Pandas users, please note that you are supposed to modify Person in place.

After running your script, the answer shown is the Person table. The driver will first compile and run your piece of code and then show the Person table. The final order of the Person table does not matter.

The result format is in the following example.

In [54]:
data = [[1, 'john@example.com'], [2, 'bob@example.com'], [3, 'john@example.com']]
person = pd.DataFrame(data, columns=['id', 'email']).astype({'id':'int64', 'email':'object'})

In [58]:
person.sort_values(by='id', inplace=True)
person.drop_duplicates(subset='email', keep='first', inplace=True)
person

   id             email
0   1  john@example.com
1   2   bob@example.com